In [14]:
import pandas as pd

# Crear DataFrame

#### Metodo 1: Lista de listas

In [15]:
c = ["Marca","Precio","Disponibilidad"]

carA = ["Mercedez","10e3",True]
carB = ["BMW","20e3",False]

df1 = pd.DataFrame([carA,carB],columns = c)

df1

      Marca Precio  Disponibilidad
0  Mercedez   10e3            True
1       BMW   20e3           False

#### Metodo 2: Usando zip

In [16]:
marcas = ["Audi","Mercedez","BMW","Mercedez"]
precio = [20e3,30e3,40e3,25e3]
disponibilidad = [True,False,False,True]

df2 = pd.DataFrame(list(zip(marcas,precio,disponibilidad)), columns = c)

df2

      Marca   Precio  Disponibilidad
0      Audi  20000.0            True
1  Mercedez  30000.0           False
2       BMW  40000.0           False
3  Mercedez  25000.0            True

#### Metodo 3: Usando un diccionario

In [17]:
diccionario = {
     "marcas": marcas,
     "precios": precio,
     "disponibilidad": disponibilidad
}

df3 = pd.DataFrame(diccionario)

df3

     marcas  precios  disponibilidad
0      Audi  20000.0            True
1  Mercedez  30000.0           False
2       BMW  40000.0           False
3  Mercedez  25000.0            True

# Agregar Columnas DataFrame

In [18]:
personas = {
     "nombre": ["Dimas","Juan","Jose"],
     "edad": [20,23,25],
     "dni": ["48014003p","48014003p","48014003p"]
}

df = pd.DataFrame(personas)
df

  nombre  edad        dni
0  Dimas    20  48014003p
1   Juan    23  48014003p
2   Jose    25  48014003p

#### Metodo 1: Sintaxis basica

In [19]:
df["profesiones"] = ["Ingeniero","Maestro","Bombrero"]
df

  nombre  edad        dni profesiones
0  Dimas    20  48014003p   Ingeniero
1   Juan    23  48014003p     Maestro
2   Jose    25  48014003p    Bombrero

#### Metodo 2: Assign

In [40]:
df = df.assign(sueldo=[20e3,30e3,40e3])
df

  nombre        email  edad        dni profesiones   sueldo
0  Dimas  dimas@email    20  48014003p   Ingeniero  20000.0
1   Juan   juan@email    23  48014003p     Maestro  30000.0
2   Jose   jose@email    25  48014003p    Bombrero  40000.0

#### Metodo 3: insert

In [20]:
#df.insert(1,"email",["dimas@email","juan@email","jose@email"])

In [21]:
df

  nombre        email  edad        dni profesiones
0  Dimas  dimas@email    20  48014003p   Ingeniero
1   Juan   juan@email    23  48014003p     Maestro
2   Jose   jose@email    25  48014003p    Bombrero

# Extraer filas de DataFrame

In [22]:
df

  nombre        email  edad        dni profesiones
0  Dimas  dimas@email    20  48014003p   Ingeniero
1   Juan   juan@email    23  48014003p     Maestro
2   Jose   jose@email    25  48014003p    Bombrero

#### Metod 1: Sintaxis basica

In [23]:
df[df["nombre"] == "Dimas"]

  nombre        email  edad        dni profesiones
0  Dimas  dimas@email    20  48014003p   Ingeniero

#### Metodo 2: isin

In [43]:
df[df.email.isin(["dimas@email","juan@email"])]

  nombre        email  edad        dni profesiones   sueldo
0  Dimas  dimas@email    20  48014003p   Ingeniero  20000.0
1   Juan   juan@email    23  48014003p     Maestro  30000.0

In [29]:
df[df.email.isin(["dimas@email","juan@email"]) | df.nombre.isin(["Jose"])]

  nombre        email  edad        dni profesiones
0  Dimas  dimas@email    20  48014003p   Ingeniero
1   Juan   juan@email    23  48014003p     Maestro
2   Jose   jose@email    25  48014003p    Bombrero

#### Metodo 3: iloc

In [32]:
df.iloc[[0,1],[2,3]]

   edad        dni
0    20  48014003p
1    23  48014003p

In [33]:
df.iloc[[0,1],:]

  nombre        email  edad        dni profesiones
0  Dimas  dimas@email    20  48014003p   Ingeniero
1   Juan   juan@email    23  48014003p     Maestro

#### Metod0 4: set_index and loc

In [37]:
dfn = df.set_index("nombre")
dfn.loc[["Jose","Juan"]]

             email  edad        dni profesiones
nombre
Jose    jose@email    25  48014003p    Bombrero
Juan    juan@email    23  48014003p     Maestro

In [39]:
dfn.loc[["Jose","Juan"],["email"]]

             email
nombre
Jose    jose@email
Juan    juan@email